IDENTIFICATION DIVISION.
PROGRAM-ID. BANKSYS.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ACCOUNT-FILE ASSIGN TO "ACCOUNT.DAT".
    SELECT TRANSACTION-FILE ASSIGN TO "TRANSACTION.DAT".
DATA DIVISION.
FILE SECTION.
FD ACCOUNT-FILE
   LABEL RECORDS STANDARD
   VALUE OF FILE-ID IS "ACCOUNT.DAT"
   DATA RECORD IS ACCOUNT-REC.
01 ACCOUNT-REC.
   05 ACCOUNT-NUMBER PIC 9(6).
   05 ACCOUNT-NAME PIC X(20).
   05 ACCOUNT-BALANCE PIC 9(10)V99.
FD TRANSACTION-FILE
   LABEL RECORDS STANDARD
   VALUE OF FILE-ID IS "TRANSACTION.DAT"
   DATA RECORD IS TRANSACTION-REC.
01 TRANSACTION-REC.
   05 TRANSACTION-DATE PIC 9(8).
   05 TRANSACTION-TYPE PIC X(1).
   05 TRANSACTION-AMOUNT PIC 9(10)V99.
   05 TRANSACTION-ACCOUNT PIC 9(6).
WORKING-STORAGE SECTION.
01 WS-ACCOUNT-NUMBER PIC 9(6).
01 WS-ACCOUNT-NAME PIC X(20).
01 WS-ACCOUNT-BALANCE PIC 9(10)V99.
01 WS-TRANSACTION-DATE PIC 9(8).
01 WS-TRANSACTION-TYPE PIC X(1).
01 WS-TRANSACTION-AMOUNT PIC 9(10)V99.
01 WS-TRANSACTION-ACCOUNT PIC 9(6).
01 WS-EOF PIC X(1) VALUE 'N'.
PROCEDURE DIVISION.
MAIN-PROCEDURE.
    PERFORM INITIALIZATION
    PERFORM PROCESS-TRANSACTION UNTIL WS-EOF = 'Y'
    PERFORM TERMINATION
    STOP RUN.
INITIALIZATION.
    OPEN INPUT ACCOUNT-FILE
    OPEN I-O TRANSACTION-FILE
    READ ACCOUNT-FILE
        AT END
            SET WS-EOF TO 'Y'
    END-READ.
PROCESS-TRANSACTION.
    DISPLAY "Enter account number: "
    ACCEPT WS-ACCOUNT-NUMBER
    READ ACCOUNT-FILE
        INVALID KEY
            DISPLAY "Account not found."
            GO TO PROCESS-TRANSACTION
        END-READ
    MOVE ACCOUNT-NAME TO WS-ACCOUNT-NAME
    MOVE ACCOUNT-BALANCE TO WS-ACCOUNT-BALANCE
    DISPLAY "Account name: " WS-ACCOUNT-NAME
    DISPLAY "Account balance: " WS-ACCOUNT-BALANCE
    DISPLAY "Enter transaction date (YYYYMMDD): "
    ACCEPT WS-TRANSACTION-DATE
    DISPLAY "Enter transaction type (D/W/T): "
    ACCEPT WS-TRANSACTION-TYPE
    DISPLAY "Enter transaction amount: "
    ACCEPT WS-TRANSACTION-AMOUNT
    COMPUTE WS-ACCOUNT-BALANCE = 
        (WS-TRANSACTION-TYPE = 'D' 
            IF TRUE 
                THEN WS-ACCOUNT-BALANCE + WS-TRANSACTION-AMOUNT 
                ELSE WS-ACCOUNT-BALANCE - WS-TRANSACTION-AMOUNT)
    MOVE WS-ACCOUNT-BALANCE TO ACCOUNT-BALANCE
    WRITE TRANSACTION-REC
        INVALID KEY
            DISPLAY "Error writing transaction."
    DISPLAY "Transaction complete."
    DISPLAY "Do you want to continue (Y/N)? "
    ACCEPT WS-EOF.
TERMINATION.
    CLOSE ACCOUNT-FILE, TRANSACTION-FILE.
